
## Plan Result




<pre><code>Plan: 3 to add, 14 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sdp-database-flexible
  * azurerm_key_vault_secret.sdp-host-flexible
  * azurerm_key_vault_secret.sdp-port-flexible
* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.sdp-database
  * azurerm_key_vault_secret.sdp-host
  * azurerm_key_vault_secret.sdp-port
  * azurerm_key_vault_secret.secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.secret[&#34;USER&#34;]
  * module.database.azurerm_postgresql_server.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-FLEXIBLE-DATABASE/b0731287416a445b8c6d40f47bc7b0d2"
        name                    = "subscription-management-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-FLEXIBLE-HOST/9ee426b0ade84a4ead245bafd5d7dbe8"
        name                    = "subscription-management-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-FLEXIBLE-PASS/4db7173488f44618bc53297a4067d1c1"
        name                    = "subscription-management-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-FLEXIBLE-PORT/8bd544b881a14731a83cfe261069ac94"
        name                    = "subscription-management-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-FLEXIBLE-USER/f74f1afcb7964c2b951f585789f77dfa"
        name                    = "subscription-management-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-database will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-database" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-DATABASE/88495ebbf0e6470fba68ee6fbb1a687d"
        name                    = "subscription-management-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-database-flexible will be created
  + resource "azurerm_key_vault_secret" "sdp-database-flexible" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "subscription-management-POSTGRES-FLEXIBLE-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "subscription-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sdp-host will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-host" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-HOST/f3f5ad0c65e04fd3bd89305543041fed"
        name                    = "subscription-management-POSTGRES-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-host-flexible will be created
  + resource "azurerm_key_vault_secret" "sdp-host-flexible" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "subscription-management-POSTGRES-FLEXIBLE-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "subscription-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sdp-port will be updated in-place
  ~ resource "azurerm_key_vault_secret" "sdp-port" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-sdp-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-PORT/a9ca5ad089a9402e84f989b93f35a7f3"
        name                    = "subscription-management-POSTGRES-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.sdp-port-flexible will be created
  + resource "azurerm_key_vault_secret" "sdp-port-flexible" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "subscription-management-POSTGRES-FLEXIBLE-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "publishing-information-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "subscription-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-DATABASE/3e62e90316ef459cb89b23e2a0cee0f7"
        name                    = "subscription-management-POSTGRES-DATABASE"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-HOST/be002f6a124f404a8596d9ff4cf43928"
        name                    = "subscription-management-POSTGRES-HOST"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-PASS/a193939b6f2349e8b4100382fe7b7d2c"
        name                    = "subscription-management-POSTGRES-PASS"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-PORT/c3e31332076742a386aafb8919678403"
        name                    = "subscription-management-POSTGRES-PORT"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2024-10-09T08:06:05Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-USER/882b9df0edbc4ba29630662a59fde87d"
        name                    = "subscription-management-POSTGRES-USER"
        tags                    = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # postgresql_grant.readonly_mv has moved to postgresql_grant.readonly_mv[0]
    resource "postgresql_grant" "readonly_mv" {
        id                = "sdp-subscription-management_subscriptionmanagement_public_table_sdp_mat_view_subscription"
        # (7 unchanged attributes hidden)
    }

  # postgresql_role.create_sdp_access has moved to postgresql_role.create_sdp_access[0]
    resource "postgresql_role" "create_sdp_access" {
        id                                  = "sdp-subscription-management"
        name                                = (sensitive value)
        # (17 unchanged attributes hidden)
    }

  # module.database.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-subscription-management-data-staging/providers/Microsoft.DBforPostgreSQL/servers/pip-subscription-management-staging"
        name                              = "pip-subscription-management-staging"
        tags                              = {
            "application"         = "publishing-information-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

Plan: 3 to add, 14 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":290,"Program":"tfcmt","SHA1":"","Vars":{}} -->